{
  "blogs": [
    {
      "id": "c86f",
      "title": "Importance Of Friends In Life",
      "body": "Friendships can have a major impact on your health and well-being, but it's not always easy to develop or maintain friendships. Understand the importance of social connection in your life and what you can do to develop and nurture lasting friendships.\n\nWhat are the benefits of friendships?\nGood friends are good for your health. Friends can help you celebrate good times and provide support during bad times. Friends prevent isolation and loneliness and give you a chance to offer needed companionship, too. Friends can also:\n\nIncrease your sense of belonging and purpose\nBoost your happiness and reduce your stress\nImprove your self-confidence and self-worth\nHelp you cope with traumas, such as divorce, serious illness, job loss or the death of a loved one\nEncourage you to change or avoid unhealthy lifestyle habits, such as excessive drinking or lack of exercise\nFriends also play a significant role in promoting your overall health. Adults with strong social connections have a reduced risk of many significant health problems, including depression, high blood pressure and an unhealthy body mass index (BMI). In fact, studies have found that older adults who have meaningful relationships and social support are likely to live longer than their peers with fewer connections.\n\nWhy is it sometimes hard to make friends or maintain friendships?\nMany adults find it hard to develop new friendships or keep up existing friendships. Friendships may take a back seat to other priorities, such as work or caring for children or aging parents. You and your friends may have grown apart due to changes in your lives or interests. Or maybe you've moved to a new community and haven't yet found a way to meet people.\n\nDeveloping and maintaining good friendships takes effort. The enjoyment and comfort friendship can provide, however, makes the investment worthwhile.\n\nWhat's a healthy number of friends?\nQuality counts more than quantity. While it may be good to cultivate a diverse network of friends and acquaintances, you may feel a greater sense of belonging and well-being by nurturing close, meaningful relationships that will support you through thick and thin.\n\nWhat are some ways to meet new friends?\nIt's possible to develop friendships with people who are already in your social network. Think through people you've interacted with — even very casually — who made a positive impression.\n\nYou may make new friends and nurture existing relationships by:\n\nStaying in touch with people with whom you've worked or taken classes\nReconnecting with old friends\nReaching out to people you've enjoyed chatting with at social gatherings\nIntroducing yourself to neighbors\nMaking time to connect with family members\nIf anyone stands out in your memory as someone you'd like to know better, reach out. Ask mutual friends or acquaintances to share the person's contact information, or — even better — to reintroduce the two of you with a text, email or in-person visit. Extend an invitation to coffee or lunch.\n\nTo meet new people who might become your friends, you have to go to places where others are gathered. Don't limit yourself to one strategy for meeting people. The broader your efforts, the greater your likelihood of success.\n\nPersistence also matters. Take the initiative rather than waiting for invitations to come your way and keep trying. You may need to suggest plans a few times before you can tell if your interest in a new friend is mutual.\n\nFor example, try several of these ideas:\n\nAttend community events. Look for groups or clubs that gather around an interest or hobby you share. You may find these groups online, or they may be listed in the newspaper or on community bulletin boards. There are also many websites that help you connect with new friends in your neighborhood or city. Do a Google search using terms such as [your city] + social network, or [your neighborhood] + meet ups.\nVolunteer. Offer your time or talents at a hospital, place of worship, museum, community center, charitable group or other organization. You can form strong connections when you work with people who have mutual interests.\nExtend and accept invitations. Invite a friend to join you for coffee or lunch. When you're invited to a social gathering, say yes. Contact someone who recently invited you to an activity and return the favor.\nTake up a new interest. Take a college or community education course to meet people who have similar interests. Join a class at a local gym, senior center or community fitness facility.\nJoin a faith community. Take advantage of special activities and get-to-know-you events for new members.\nTake a walk. Grab your kids or pet and head outside. Chat with neighbors who are also out and about or head to a popular park and strike up conversations there.\nAbove all, stay positive. You may not become friends with everyone you meet but maintaining a friendly attitude and demeanor can help you improve the relationships in your life. It may also sow the seeds of friendship with new acquaintances.\n\nHow does social media affect friendships?\nJoining a chat group or online community might help you make or maintain connections and relieve loneliness. However, research suggests that use of social networking sites doesn't necessarily translate to a larger offline network or closer offline relationships with network members. In addition, remember to exercise caution when sharing personal information or arranging an activity with someone you've only met online.\n\nHow can I nurture my friendships?\nDeveloping and maintaining healthy friendships involves give-and-take. Sometimes you're the one giving support, and other times you're on the receiving end. Letting friends know you care about them and appreciate them can help strengthen your bond. It's as important for you to be a good friend as it is to surround yourself with good friends.\n\nTo nurture your friendships:\n\nBe kind. This most-basic behavior remains the core of successful relationships. Think of friendship as an emotional bank account. Every act of kindness and every expression of gratitude are deposits into this account, while criticism and negativity draw down the account.\nBe a good listener. Ask what's going on in your friends' lives. Let the other person know you are paying close attention through eye contact, body language and occasional brief comments such as, \"That sounds fun.\" When friends share details of hard times or difficult experiences, be empathetic, but don't give advice unless your friends ask for it.\nOpen up. Build intimacy with your friends by opening up about yourself. Being willing to disclose personal experiences and concerns shows that your friend holds a special place in your life, and it may deepen your connection.\nShow that you can be trusted. Being responsible, reliable and dependable is key to forming strong friendships. Keep your engagements and arrive on time. Follow through on commitments you've made to your friends. When your friends share confidential information, keep it private.\nMake yourself available. Building a close friendship takes time — together. Make an effort to see new friends regularly, and to check in with them in between meet ups. You may feel awkward the first few times you talk on the phone or get together, but this feeling is likely to pass as you get more comfortable with each other.\nManage your nerves with mindfulness. You may find yourself imagining the worst of social situations, and you may feel tempted to stay home. Use mindfulness exercises to reshape your thinking. Each time you imagine the worst, pay attention to how often the embarrassing situations you're afraid of actually take place. You may notice that the scenarios you fear usually don't happen.\n\nWhen embarrassing situations do happen, remind yourself that your feelings will pass, and you can handle them until they do.\n\nYoga and other mind-body relaxation practices also may reduce anxiety and help you face situations that make you feel nervous.\n\nRemember, it's never too late to develop new friendships or reconnect with old friends. Investing time in making friends and strengthening your friendships can pay off in better health and a brighter outlook for years to come.",
      "author": "Yash Gurav"
    },
    {
      "id": "c361",
      "title": "Sportsmanship",
      "body": "Most reasonable athletes and parents would agree that sportsmanship is an important aspect of athletics. Although it comes in many forms, everyone can give a few examples of what sportsmanship looks like and what it takes to be viewed as a “good sport”: We shake hands before and after games, we clap for injured players once they show they are okay, and we extend a hand to help an opponent get up off of the ground. These examples are just scratching the surface of displaying good sportsmanship.\n\nSportsmanship is an understanding of and commitment to fair play, ethical behavior and integrity, and general goodwill toward an opponent. It is an affirmation that an athlete is disciplined enough to have perspective, maintain poise and do what is best for his or her teammates. Being able to make appropriate behavioral choices at the “moment of truth” and in a pressure situation will often reveal a player’s character and his or her ability to be a good sport. Simply put, sportsmanship is a choice.\n\nIt is easy for parents and kids to get caught up in a game and become too focused on winning. Although winning is important, it is not always the most important aspect of the game. There is so much to be gained and learned from an athletic experience that will stay with you for the rest of your life. Good sportsmanship is one of those life lessons that should be intentionally learned, taught, practiced and reinforced.\n\nNo matter how much we would like to, we cannot win at everything every time. So we need to learn to deal with defeat. After a hard fought game in which everything was left on the playing field in a losing effort, it can be very difficult to look your opponents in the eye and tell them “good game” or “good job.” But this is what is asked of athletes. The key question is: How do we handle losing with dignity?\n\nKeep losing in perspective. Youth sports are a learning experience. Very few wins and losses are remembered, even a short time later. Always accept responsibility for the loss. Acknowledge the winners and congratulate them. Sometimes your opponent was just better. Even if they are not better, they were better during that particular contest. The effort should be acknowledged. Sulking shows a lack of discipline.\n\nWinning is fun! It is the reward for your hard work. When we participate in a sport that keeps score, it is our obligation to the team to do our best to win within the rules of the game and within the spirit of the game. Winning becomes a negative when it is a team’s only goal.\n\nKeep winning in perspective. Winning doesn’t mean you were perfect or that you will win again. Celebrate your win, but celebrate your win with grace. Have empathy for the team you defeated; win with humility and class. Acknowledge your opponents’ effort and that they were worthy competitors. North Carolina basketball Coach Dean Smith once said, “A lion never roars after a kill.” I love that quote and the parallel to what “good winning” should look like.\n\nA recent study conducted by the NCAA showed that while sportsmanship among players has improved over the years, sportsmanship in the fans and parents has declined. It has always intrigued me why people in the stands often feel they have more invested than the actual participants. Is it the time and money invested into private lessons and travel teams? Is it living vicariously through our kids? Is it the college scholarship we need our children to earn? Is it the fear of seeing our kids fail? In any event, we, as parents and fans, should all take a step back and determine if we are helping our kids, or undermining the experience.\n\nAs a father of four kids who enjoys participating in athletics, I have to remind myself that it is okay when my kid misses a shot, strikes out, or doesn’t play good enough defense. That fact is, it is their game and their experience, and my playing days are over. A good reminder for me when I feel like my kid needs my advice from the stands comes from the great John Wooden, basketball player and head Coach at the University of California at Los Angeles. Coach Wooden once said, “Young people need models, not critics.”\n\nInstead of being upset with what my kid is not doing well, or how an official has “cheated” our team, I should focus on helping my kid learn to respect the other team. I should watch my language and the negative comments that could come from my mouth. I should respect the officials and not argue every call that is made. Perhaps most importantly, I should support my kids’ team, win or lose.\n\nLife is tough, and life is not fair. Like life, sports are tough and not always fair. Yet sports can be a wonderful training ground for life’s challenges. Just like we win some and lose some in sports, we also deal with plenty of successes, challenges and failures in our lives. Let’s try to be good sports in both the winning and losing situations and during our successes, challenges and failures.\n\nI think it is a good reminder for all of us that there are only four roles during a game: spectator, competitor, official and coach. Everyone involved in athletics would be wise to choose only one of those roles at a time.\n\nI leave you with one more quote; however, I truly could go on and on. In my opinion, Knute Rockne, football player and Coach at the University of Notre Dame, said it best: “One man practicing sportsmanship is far better than a hundred teaching it.”\n\nDo not just simply say, “be a good sport.” Model it, teach it, expect it.",
      "author": "Vidhi Sorte"
    }
  ]
}